Repository: scatana/vali
Catalog: src/i18n/messages.*.xlf
Languages: ro

source: Valentina Catana - Certified Translator, Montreal
ro: Valentina Cătană - Traducător autorizat, Montreal

source: Certified translator Montreal, Quebec, Canada. Certified translations from and into English, French, Romanian. Official documents, general texts, subtitling.
ro: Traducător autorizat Montreal, Quebec, Canada. Traduceri autorizate din și în română, franceză, engleză. Documente oficiale, texte generale, subtitrări.

source: Catana
ro: Cătană

source: Certified Translator. Member of OTTIAQ.
ro: Traducător autorizat. Membru OTTIAQ.

source: Valentina Catana
ro: Valentina Cătană

source: Certified Translator
ro: Traducător autorizat

source: Toggle navigation
ro: Afișează/închide meniu

source: Close
ro: Închide

source: Services
ro: Servicii

source: Rates
ro: Tarife

source: Testimonials
ro: Impresii

source: language
ro: limbă
